{
  "backend/main.mo": "Minimal Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report describing removal of footer attribution text and listing affected file and components.",
  "frontend-file-summaries.txt": "Collection of short summaries for various frontend files detailing styling, components, and UI behaviors.",
  "frontend/index.css": "Defines global Tailwind layers and extensive CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component composing layout, background, header, content sections, footer, floating buttons, and scheme modal.",
  "frontend/src/components/background/CinematicBackground.tsx": "Full‑screen autoplaying background video with gradient and vignette overlays.",
  "frontend/src/components/calculator/LiveCalculator.tsx": "Interactive financial calculator adjusting amount and tenure to compute scheme-specific returns with animations.",
  "frontend/src/components/footer/Footer.tsx": "Footer showing current year, copyright, and a disclaimer.",
  "frontend/src/components/header/FrostedHeader.tsx": "Frosted header with title, IT 2.0 button opening a modal, and a location pill.",
  "frontend/src/components/header/It20Modal.tsx": "Modal describing IT 2.0 features with ESC handling and detailed text content.",
  "frontend/src/components/layout/DashboardLayout.tsx": "Simple layout wrapper providing a full‑height container for app content.",
  "frontend/src/components/motto/RightEdgeMotto.tsx": "Fixed right‑side vertical motto text displayed on large screens.",
  "frontend/src/components/profile/BpmProfileCard.tsx": "Expandable profile card showing a BPM’s photo and bio with typewriter effects.",
  "frontend/src/components/profile/TypewriterNeon.tsx": "Typewriter-like animated text component that reveals lines sequentially.",
  "frontend/src/components/schemes/SchemeCard.tsx": "Clickable scheme preview card showing icon, label, and description.",
  "frontend/src/components/schemes/SchemeGrid.tsx": "Displays a grid of all schemes and triggers callbacks on card clicks.",
  "frontend/src/components/schemes/SchemeModal.tsx": "Modal showing full scheme details with tabs and a close button.",
  "frontend/src/components/schemes/SchemeTabs.tsx": "Tabbed interface presenting history, eligibility, benefits, documents, and calculator for a scheme.",
  "frontend/src/components/schemes/useSchemeModal.ts": "Custom hook managing scheme modal state and selected scheme.",
  "frontend/src/components/support/CallFloatingButton.tsx": "Floating button enabling quick phone calls with animated effects.",
  "frontend/src/components/support/WhatsAppFloatingButton.tsx": "Floating WhatsApp contact button with tooltip and animations.",
  "frontend/src/components/testimonials/TestimonialsMarquee.tsx": "Scrolling marquee displaying duplicated customer testimonials.",
  "frontend/src/data/schemes.ts": "Defines scheme data structures, calculator configs, and the full schemes dataset.",
  "frontend/src/data/testimonials.ts": "Defines a Testimonial interface and exports a static list of six user testimonials with name, location, and message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using react-query, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks to manage Internet Identity authentication, including login, logout, and persisted identity handling.",
  "frontend/src/index.css": "Defines Tailwind base styles and a dark luxury theme using CSS variables with custom utilities like frosted glass and glow effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors mapped to CSS variables, extended utilities, and additional plugins.",
  "project_state.json": "Project state description containing UI goals, design system requirements, known issues, and existing features for the India Post IT 2.0 site."
}