{
  "backend/main.mo": "Empty Motoko actor with no functions or state.",
  "feature_evidence.json": "Feature evidence report listing features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and styling notes for various frontend files.",
  "frontend/index.css": "Global Tailwind base defining color variables, dark mode values, and shared border/background styles.",
  "frontend/index.html": "HTML entry point preloading audio and mounting the root React app.",
  "frontend/src/App.tsx": "Main app component assembling layout, background, modals, grids, and global audio hooks.",
  "frontend/src/components/background/CinematicBackground.tsx": "Background video component with autoplay handling and gradient overlays.",
  "frontend/src/components/calculator/LiveCalculator.tsx": "Interactive scheme calculator computing maturity values with sliders, inputs, and animated result state.",
  "frontend/src/components/footer/Footer.tsx": "Footer showing copyright and disclaimer text with official styling.",
  "frontend/src/components/gallery/GalleryCard.tsx": "Clickable gallery card playing tap sound and displaying icon, label, and hover effects.",
  "frontend/src/components/gallery/galleryImages.ts": "Exports a list of gallery image metadata including src, filename, and alt text.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "A lightbox component that displays a full-screen image preview with navigation, download, and close controls, using click-sound feedback.",
  "frontend/src/components/gallery/GalleryModal.tsx": "A modal gallery viewer showing image thumbnails and launching a lightbox with keyboard navigation and download support.",
  "frontend/src/components/header/FrostedHeader.tsx": "Renders the site header with title, IT 2.0 button, and location pill while controlling the IT 2.0 modal state.",
  "frontend/src/components/header/It20Modal.tsx": "A modal describing India Post IT 2.0 with ESC/backdrop close handling and click-sound feedback.",
  "frontend/src/components/ippb/IppbFloatingButton.tsx": "Empty placeholder file.",
  "frontend/src/components/ippb/IppbGridCard.tsx": "A grid card that opens an IPPB overlay dialog and features interactive 3D logo visuals with tap-sound activation.",
  "frontend/src/components/ippb/IppbOverlayDialog.tsx": "An overlay dialog presenting IPPB service categories with icons and descriptions, closing via shadcn dialog events.",
  "frontend/src/components/layout/DashboardLayout.tsx": "Simple layout wrapper providing a full-screen container for nested dashboard content.",
  "frontend/src/components/motto/RightEdgeMotto.tsx": "Displays a fixed vertical motto along the right edge of the screen on large displays.",
  "frontend/src/components/profile/BpmProfileCard.tsx": "Profile card that expands into a detailed overlay with bio text, image, and typewriter effect, using click sounds.",
  "frontend/src/components/profile/TypewriterNeon.tsx": "Typewriter component that renders lines sequentially with typing animation.",
  "frontend/src/components/prompt/PromptCopySection.tsx": "UI section showing a predefined clone prompt with a copy-to-clipboard button and feedback.",
  "frontend/src/components/schemes/SchemeCard.tsx": "Clickable card for a postal scheme showing icon, label, and description with sound feedback.",
  "frontend/src/components/schemes/SchemeGrid.tsx": "Grid layout rendering all scheme cards plus gallery and IPPB cards.",
  "frontend/src/components/schemes/SchemeModal.tsx": "Modal displaying detailed scheme info with tabs and close sound.",
  "frontend/src/components/schemes/SchemeTabs.tsx": "Tabbed interface showing scheme history, eligibility, benefits with calculator, and documents.",
  "frontend/src/components/schemes/useSchemeModal.ts": "Hook managing scheme modal open state and selected scheme ID.",
  "frontend/src/components/support/CallFloatingButton.tsx": "Floating call button linking to a phone number with glow and animation.",
  "frontend/src/components/support/WhatsAppFloatingButton.tsx": "Floating WhatsApp contact button with tooltip and animated glow.",
  "frontend/src/components/testimonials/TestimonialsMarquee.tsx": "Auto-scrolling testimonial marquee duplicating entries for seamless animation.",
  "frontend/src/data/schemes.ts": "Defines scheme types, tab content, calculator configs, and a full dataset for various postal savings schemes.",
  "frontend/src/data/testimonials.ts": "Provides a typed list of customer testimonials with id, name, location, and message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using React Query and Internet Identity.",
  "frontend/src/hooks/useAudioUnlock.ts": "Adds one-time global listeners to unlock audio playback on first user interaction.",
  "frontend/src/hooks/useClickSound.ts": "Provides tap and close sound effects with preload, debouncing, and cleanup logic.",
  "frontend/src/hooks/useGlobalTapSound.ts": "Registers a global pointer-down listener to play tap sounds with throttling and input-field exclusions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login handling, identity persistence, and provider setup.",
  "frontend/src/index.css": "Defines Tailwind-based global styles, dark theme variables, utility classes, and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind config defining dark mode, content paths, extended color palette, shadows, radii, and custom keyframe animations.",
  "project_state.json": "Project state metadata containing version info, rollback-related issues, and feature requests to remove recent blinking visual changes."
}