{
  "backend/main.mo": "Actor implements profile creation, user profile storage, and profile rating with authorization checks and map-based persistence.",
  "backend/migration.mo": "Defines a simple migration that converts an old actor with a text Set to an empty new actor state.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files detailing styling, animations, data, and component behavior.",
  "frontend/index.css": "Root CSS variables and dark theme definitions using oklch values, plus Tailwind base styling rules.",
  "frontend/index.html": "HTML entry point setting up meta tags, preloading audio, mounting root div, and loading main TSX module.",
  "frontend/src/App.tsx": "Main application component composing background, header, scheme grid, profile card, testimonials, floating buttons, and modals.",
  "frontend/src/components/background/CinematicBackground.tsx": "Full-screen video background with gradient overlays and vignette for improved contrast.",
  "frontend/src/components/calculator/LiveCalculator.tsx": "Interactive interest calculator with scheme-specific logic and animated result text.",
  "frontend/src/components/footer/Footer.tsx": "Simple footer showing current year and site attribution.",
  "frontend/src/components/gallery/GalleryCard.tsx": "Clickable gallery card with sound feedback that opens the gallery view.",
  "frontend/src/components/gallery/galleryImages.ts": "Defines the GalleryImage type and exports the list of gallery image metadata.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Full-screen lightbox for viewing, navigating, and downloading gallery images with sound effects.",
  "frontend/src/components/gallery/GalleryModal.tsx": "Modal displaying a grid of gallery images and launching the lightbox with keyboard navigation and error handling.",
  "frontend/src/components/header/FrostedHeader.tsx": "Frosted-glass site header with branding, location display, and IT 2.0 modal trigger.",
  "frontend/src/components/header/It20Modal.tsx": "Informational modal describing India Post IT 2.0, with ESC handling and close animations.",
  "frontend/src/components/ippb/IppbFloatingButton.tsx": "Bottom-center floating IPPB button that opens an overlay dialog with sound feedback.",
  "frontend/src/components/ippb/IppbGridCard.tsx": "Grid card for IPPB services that opens its overlay dialog via click or keyboard activation.",
  "frontend/src/components/ippb/IppbOverlayDialog.tsx": "Glass-morphic modal showing animated IPPB service cards with close-sound logic and shadcn-ui dialog features.",
  "frontend/src/components/layout/DashboardLayout.tsx": "Simple layout wrapper providing full-height container for dashboard content.",
  "frontend/src/components/motto/RightEdgeMotto.tsx": "Fixed right-edge vertical motto text displayed on large screens.",
  "frontend/src/components/notice/CloneWorkBlockedNotice.tsx": "Notice component explaining requirements for performing exact website cloning.",
  "frontend/src/components/profile/BpmProfileCard.tsx": "Interactive BPM profile card with expand animation, details view, and rating dialog trigger on close.",
  "frontend/src/components/profile/ProfileRatingDialog.tsx": "Dialog allowing users to submit 1–5 star profile ratings with sound effects and UI feedback.",
  "frontend/src/components/profile/TypewriterNeon.tsx": "Typewriter animation component that renders lines sequentially with blinking cursor and styled name highlighting.",
  "frontend/src/components/prompt/PromptCopySection.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/schemes/SchemeCard.tsx": "Clickable scheme card with animated icon, description, and 'Learn More' indicator triggering scheme selection.",
  "frontend/src/components/schemes/SchemeGrid.tsx": "Grid layout rendering all schemes plus gallery and IPPB cards, delegating click callbacks upward.",
  "frontend/src/components/schemes/SchemeModal.tsx": "Modal displaying selected scheme details with tabs and close-sound handling, including styling for RBP schemes.",
  "frontend/src/components/schemes/SchemeTabs.tsx": "Renders tabbed scheme info and optionally styles RBP schemes, including a benefits tab with a LiveCalculator.",
  "frontend/src/components/schemes/useSchemeModal.ts": "Provides state and handlers for opening and closing a scheme selection modal with delayed reset.",
  "frontend/src/components/support/CallFloatingButton.tsx": "Floating call button linking to a phone number with glow effects and animated icon.",
  "frontend/src/components/support/WhatsAppFloatingButton.tsx": "Floating WhatsApp button with gradient styling, tooltip, and link to a chat URL.",
  "frontend/src/components/testimonials/TestimonialsMarquee.tsx": "Displays an infinitely scrolling marquee of testimonials with duplicated data for seamless looping.",
  "frontend/src/components/warning/CopyrightInfoDialog.tsx": "Modal dialog showing a copyright warning with animated red styling and close handling.",
  "frontend/src/components/warning/WarningSection.tsx": "Renders an info button that opens the copyright warning dialog with click‑sound feedback.",
  "frontend/src/data/schemes.ts": "Defines scheme types, tab content, calculator config, and exports detailed scheme data.",
  "frontend/src/data/testimonials.ts": "Exports a list of testimonial objects with id, name, location, and message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useAudioUnlock.ts": "Registers one‑time user‑gesture listeners to unlock audio playback using a silent audio clip.",
  "frontend/src/hooks/useClickSound.ts": "Provides tap and close sound effects with debouncing and asset preloading.",
  "frontend/src/hooks/useGlobalTapSound.ts": "Registers a global pointerdown listener to play tap sounds with throttling and input exclusion.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useProfileRating.ts": "Fetches and submits profile ratings using React Query and an actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles and an extensive dark-first OKLCH color theme.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and layout with custom OKLCH variables.",
  "project_state.json": "Stores project version, feature definitions, and pending requests for bio/profile page updates, animations, text changes, color adjustments, and rating capture. Contains metadata such as schema version, existing features, and new feature requests."
}