{
  "kind": "build_request",
  "title": "Restore UI to the previous version (rollback recent blinking/color changes)",
  "projectName": "IPPB Interactive Portal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the recently introduced \"live blink\" icon animation across the site by eliminating usage of the `icon-live-blink-2s` class and removing (or disabling) the corresponding CSS animation so icons no longer blink.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ğ¬ğ¢ğ­ğ ğ¤ğ¨ ğ©ğ¡ğğ¥ğ ğ£ğğ¬ğš ğ¤ğšğ«ğ¨ ğ£ğğ¬ğ ğ©ğ¡ğğ¥ğ ğ­ğ¡ğ¢"
        ]
      },
      "acceptanceCriteria": [
        "No icons blink anywhere in the UI (including scheme cards, header IT 2.0 icon, gallery icon, and floating buttons).",
        "`icon-live-blink-2s` is no longer applied in React components, and the animation does not run in the browser."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Restore headings to their previous styling by removing the `heading-primary-live` class wherever applied and removing (or disabling) its CSS so headings are no longer forced to dark red and do not blink.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ğ¬ğ¢ğ­ğ ğ¤ğ¨ ğ©ğ¡ğğ¥ğ ğ£ğğ¬ğš ğ¤ğšğ«ğ¨ ğ£ğğ¬ğ ğ©ğ¡ğğ¥ğ ğ­ğ¡ğ¢"
        ]
      },
      "acceptanceCriteria": [
        "Section titles and modal titles do not blink.",
        "Headings are not forced to the special dark-red heading color introduced by `heading-primary-live` and instead follow the base heading styles."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Restore modal/overlay close (X) buttons to their previous appearance by removing the `close-x-live-blink-3s` class from all close icons and removing (or disabling) its CSS so close icons are not forced red and do not blink.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ğ¬ğ¢ğ­ğ ğ¤ğ¨ ğ©ğ¡ğğ¥ğ ğ£ğğ¬ğš ğ¤ğšğ«ğ¨ ğ£ğğ¬ğ ğ©ğ¡ğğ¥ğ ğ­ğ¡ğ¢"
        ]
      },
      "acceptanceCriteria": [
        "Close (X) icons in all dialogs/modals/lightboxes do not blink.",
        "Close (X) icons are not forced to the special red color introduced by `close-x-live-blink-3s`."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Audit and revert any other visual changes introduced specifically to support the new blinking/color update set (including any helper classes added only for that update) so the site matches the look and behavior of the pre-change version.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ğ¬ğ¢ğ­ğ ğ¤ğ¨ ğ©ğ¡ğğ¥ğ ğ£ğğ¬ğš ğ¤ğšğ«ğ¨ ğ£ğğ¬ğ ğ©ğ¡ğğ¥ğ ğ­ğ¡ğ¢"
        ]
      },
      "acceptanceCriteria": [
        "There are no remaining references to the rollbacked blink/color utilities in `frontend/src` (including CSS and component classNames).",
        "The UI has no new blink-based effects compared to the previous version and behaves normally under `prefers-reduced-motion` (no special-casing needed for removed effects)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (read-only UI components must be composed, not modified).",
    "Do not edit immutable hook/bootstrap files: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`.",
    "Backend must remain single-actor; do not add additional canisters/services."
  ],
  "nonGoals": [
    "Adding new animations or additional visual effects.",
    "Introducing new features or changing site content/structure beyond rolling back the recent blinking/color-related changes.",
    "Backend changes (no Motoko logic changes required for this rollback)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}